-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: 23 ส.ค. 2023 เมื่อ 10:36 AM
-- เวอร์ชันของเซิร์ฟเวอร์: 8.0.33-0ubuntu0.20.04.2
-- PHP Version: 7.4.3-4ubuntu2.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `wordpress`
--

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `wp_groupsara`
--

CREATE TABLE `wp_groupsara` (
  `ID` bigint UNSIGNED NOT NULL,
  `group_id` bigint UNSIGNED DEFAULT NULL COMMENT 'รหัสกลุ่มสาระ',
  `group_nicename` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'อักษรย่อ',
  `group_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'กลุ่มสาระ',
  `group_status` bigint DEFAULT NULL COMMENT 'สถานะ',
  `activity_id` bigint UNSIGNED DEFAULT NULL COMMENT 'รหัสกิจกรรม',
  `activity_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'ชื่อกิจกรรม',
  `class_id` bigint UNSIGNED DEFAULT NULL COMMENT 'รหัสระดับ',
  `class_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'ชื่อระดับ',
  `student_no` bigint UNSIGNED DEFAULT NULL COMMENT 'จำนวนนักเรียน',
  `teacher_no` bigint UNSIGNED DEFAULT NULL COMMENT 'จำนวนผู้ควบคุม',
  `location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'สถานที่แข่งขัน',
  `match_time` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'เวลาการแข่งขัน',
  `match_date` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'วันที่แข่งขัน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_520_ci;

--
-- dump ตาราง `wp_groupsara`
--

INSERT INTO `wp_groupsara` (`ID`, `group_id`, `group_nicename`, `group_name`, `group_status`, `activity_id`, `activity_name`, `class_id`, `class_name`, `student_no`, `teacher_no`, `location`, `match_time`, `match_date`) VALUES
(1, 1, 'ท.', 'ภาษาไทย', 1, 1, 'การกล่าวสุนทรพจน์ภาษาไทย', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(2, 1, 'ท.', 'ภาษาไทย', 1, 2, 'การกล่าวสุนทรพจน์ภาษาไทย', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(3, 1, 'ท.', 'ภาษาไทย', 1, 3, 'การกล่าวสุนทรพจน์ภาษาไทย', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(4, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 4, 'การกล่าวสุนทรพจน์ภาษาอังกฤษ', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(5, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 5, 'การกล่าวสุนทรพจน์ภาษาอังกฤษ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(6, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 6, 'การกล่าวสุนทรพจน์ภาษาอังกฤษ', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(7, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 7, 'การกล่าวสุนทรพจน์ภาษาจีน', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(8, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 8, 'การกล่าวสุนทรพจน์ภาษาจีน', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(9, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 9, 'การกล่าวสุนทรพจน์ภาษาจีน', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(10, 7, 'ง.', 'การงานอาชีพ', 1, 10, 'การประดิษฐ์สิ่งของจากวัสดุเหลือใช้ (ประดิษฐ์ของเล่น)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(11, 7, 'ง.', 'การงานอาชีพ', 1, 11, 'การประดิษฐ์สิ่งของจากวัสดุเหลือใช้ (ประดิษฐ์ของใช้)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(12, 7, 'ง.', 'การงานอาชีพ', 1, 12, 'การประดิษฐ์สิ่งของจากวัสดุเหลือใช้ (ประดิษฐ์ของประดับตกแต่งบ้าน)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(13, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 13, 'การร้องเพลงพระราชนิพนธ์พร้อมจินตลีลา', 3, 'ป.4-6', 9, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(14, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 14, 'การร้องเพลงพระราชนิพนธ์พร้อมจินตลีลา', 4, 'ม.1-3', 9, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(15, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 15, 'การร้องเพลงพระราชนิพนธ์พร้อมจินตลีลา', 5, 'ม.4-6', 9, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(16, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 16, 'การร้องเพลงลูกทุ่งพร้อมแดนเซอร์', 6, 'ป.1-6', 9, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(17, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 17, 'การร้องเพลงลูกทุ่งพร้อมแดนเซอร์', 7, 'ม.1-6', 9, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(18, 10, 'ป.', 'ปฐมวัย', 1, 18, 'การวาดภาพระบายสี', 1, 'อายุ 5-6 ปี', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(19, 6, 'ศ.', 'ศิลปะ', 1, 19, 'การวาดภาพระบายสี', 2, 'ป.1-3', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(20, 6, 'ศ.', 'ศิลปะ', 1, 20, 'การวาดภาพระบายสี', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(21, 6, 'ศ.', 'ศิลปะ', 1, 21, 'การวาดภาพระบายสี', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(22, 6, 'ศ.', 'ศิลปะ', 1, 22, 'การวาดภาพระบายสี', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(23, 7, 'ง.', 'การงานอาชีพ', 1, 23, 'แกะสลักผักผลไม้', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(24, 7, 'ง.', 'การงานอาชีพ', 1, 24, 'แกะสลักผักผลไม้', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(25, 7, 'ง.', 'การงานอาชีพ', 1, 25, 'แกะสลักผักผลไม้', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(26, 7, 'ง.', 'การงานอาชีพ', 1, 26, 'งานประดิษฐ์ร้อยมาลัย', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(27, 7, 'ง.', 'การงานอาชีพ', 1, 27, 'งานประดิษฐ์ร้อยมาลัย', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(28, 7, 'ง.', 'การงานอาชีพ', 1, 28, 'งานประดิษฐ์ร้อยมาลัย', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(29, 7, 'ง.', 'การงานอาชีพ', 1, 29, 'งานประดิษฐ์จากใบตอง', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(30, 7, 'ง.', 'การงานอาชีพ', 1, 30, 'งานประดิษฐ์จากใบตอง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(31, 7, 'ง.', 'การงานอาชีพ', 1, 31, 'งานประดิษฐ์จากใบตอง', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(32, 10, 'ป.', 'ปฐมวัย', 1, 32, 'โครงงานปฐมวัย', 1, 'อายุ 5-6 ปี', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(33, 1, 'ท.', 'ภาษาไทย', 1, 33, 'โครงงานภาษาไทย', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(34, 1, 'ท.', 'ภาษาไทย', 1, 34, 'โครงงานภาษาไทย', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(35, 1, 'ท.', 'ภาษาไทย', 1, 35, 'โครงงานภาษาไทย', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(36, 2, 'ค.', 'คณิตศาสตร์', 1, 36, 'โครงงานคณิตศาสตร์', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(37, 2, 'ค.', 'คณิตศาสตร์', 1, 37, 'โครงงานคณิตศาสตร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(38, 2, 'ค.', 'คณิตศาสตร์', 1, 38, 'โครงงานคณิตศาสตร์', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(39, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 39, 'โครงงานวิทยาศาสตร์และเทคโนโลยี', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(40, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 40, 'โครงงานวิทยาศาสตร์และเทคโนโลยี', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(41, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 41, 'โครงงานวิทยาศาสตร์และเทคโนโลยี', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(42, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 42, 'โครงงานภาษาต่างประเทศ (ภาษาอังกฤษ)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(43, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 43, 'โครงงานภาษาต่างประเทศ (ภาษาอังกฤษ)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(44, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 44, 'โครงงานภาษาต่างประเทศ (ภาษาอังกฤษ)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(45, 7, 'ง.', 'การงานอาชีพ', 1, 45, 'โครงงานการงานอาชีพ', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(46, 7, 'ง.', 'การงานอาชีพ', 1, 46, 'โครงงานการงานอาชีพ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(47, 7, 'ง.', 'การงานอาชีพ', 1, 47, 'โครงงานการงานอาชีพ', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(48, 4, 'ส.', 'สังคมศึกษา', 1, 48, 'โครงงานสังคมศึกษา ศาสนา และวัฒนธรรม', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(49, 4, 'ส.', 'สังคมศึกษา', 1, 49, 'โครงงานสังคมศึกษา ศาสนา และวัฒนธรรม', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(50, 4, 'ส.', 'สังคมศึกษา', 1, 50, 'โครงงานสังคมศึกษา ศาสนา และวัฒนธรรม', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(51, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 1, 51, 'โครงงานสุขศึกษา และพลศึกษา', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(52, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 1, 52, 'โครงงานสุขศึกษา และพลศึกษา', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(53, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 1, 53, 'โครงงานสุขศึกษา และพลศึกษา', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(54, 6, 'ศ.', 'ศิลปะ', 1, 54, 'โครงงานศิลปะ', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(55, 6, 'ศ.', 'ศิลปะ', 1, 55, 'โครงงานศิลปะ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(56, 6, 'ศ.', 'ศิลปะ', 1, 56, 'โครงงานศิลปะ', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(57, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 57, 'การแสดงละครภาษาอังกฤษ', 3, 'ป.4-6', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(58, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 58, 'การแสดงละครภาษาอังกฤษ', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(59, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 59, 'การแสดงละครภาษาอังกฤษ', 5, 'ม.4-6', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(60, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 60, 'การแสดงละครภาษาจีน', 7, 'ม.1-6', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(61, 7, 'ง.', 'การงานอาชีพ', 1, 61, 'การจัดสวนถาดแห้ง', 10, 'ผสม', 4, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(62, 10, 'ป.', 'ปฐมวัย', 1, 62, 'สื่อนวัตกรรมทางการศึกษาปฐมวัย', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(63, 1, 'ท.', 'ภาษาไทย', 1, 63, 'สื่อนวัตกรรมทางการศึกษาภาษาไทย', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(64, 2, 'ค.', 'คณิตศาสตร์', 1, 64, 'สื่อนวัตกรรมทางการศึกษาคณิตศาสตร์', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(65, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 65, 'สื่อนวัตกรรมทางการศึกษาวิทยาศาสตร์และเทคโนโลยี', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(66, 8, 'อ.', 'ภาษาต่างประเทศ', 1, 66, 'สื่อนวัตกรรมทางการศึกษาภาษาต่างประเทศ (ภาษาอังกฤษ)', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(67, 7, 'ง.', 'การงานอาชีพ', 1, 67, 'สื่อนวัตกรรมทางการศึกษาการงานอาชีพ', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(68, 4, 'ส.', 'สังคมศึกษา', 1, 68, 'สื่อนวัตกรรมทางการศึกษาสังคมศึกษา ศาสนา และวัฒนธรรม', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(69, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 1, 69, 'สื่อนวัตกรรมทางการศึกษาสุขศึกษา และพลศึกษา', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(70, 6, 'ศ.', 'ศิลปะ', 1, 70, 'สื่อนวัตกรรมทางการศึกษาศิลปะ', 11, 'ครู', 1, 1, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(71, 10, 'ป.', 'ปฐมวัย', 1, 71, 'เกมส์ทายซิเสียงอะไรเอ่ย ?', 1, 'อายุ 5-6 ปี', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(72, 10, 'ป.', 'ปฐมวัย', 1, 72, 'เดินตัวหนอน', 1, 'อายุ 5-6 ปี', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(73, 10, 'ป.', 'ปฐมวัย', 1, 73, 'เริงเล่นเต้น Dancer', 1, 'อายุ 5-6 ปี', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(74, 10, 'ป.', 'ปฐมวัย', 1, 74, 'การต่อตัวต่อเสริมทักษะ', 1, 'อายุ 5-6 ปี', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(75, 10, 'ป.', 'ปฐมวัย', 1, 75, 'ฮูล่าฮูป ประกอบเพลง', 1, 'อายุ 5-6 ปี', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(76, 1, 'ท.', 'ภาษาไทย', 1, 76, 'การคัดลายมือ', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(77, 1, 'ท.', 'ภาษาไทย', 1, 77, 'การคัดลายมือ', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(78, 1, 'ท.', 'ภาษาไทย', 1, 78, 'การคัดลายมือ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(79, 1, 'ท.', 'ภาษาไทย', 1, 79, 'การคัดลายมือ', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(80, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 80, 'ทักษะทางคอมพิวเตอร์(แข่งขันการใช้โปรแกรม Microsoft PowerPoint 2021)', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(81, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 81, 'ทักษะทางคอมพิวเตอร์(แข่งขันการเขียน Homepage)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(82, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 82, 'ทักษะทางคอมพิวเตอร์(แข่งขันการเขียน Homepage)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(83, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 83, 'แข่งขันหุ่นยนต์บังคับมือ (Manual Control)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(84, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 84, 'แข่งขันหุ่นยนต์อัตโนมัติ (Automatic Control)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(85, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 1, 85, 'แข่งขันหุ่นยนต์อัตโนมัติ (Automatic Control)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(86, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 86, 'รำวงมาตรฐาน', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(87, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 87, 'รำวงมาตรฐาน', 7, 'ม.1-6', 10, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(88, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 88, 'นาฏศิลป์ไทยสร้างสรรค์', 6, 'ป.1-6', 16, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(89, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 1, 89, 'นาฏศิลป์ไทยสร้างสรรค์', 7, 'ม.1-6', 16, 4, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(90, 4, 'ส.', 'สังคมศึกษา', 1, 90, 'ตอบปัญหาคุณธรรม', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(91, 4, 'ส.', 'สังคมศึกษา', 1, 91, 'ตอบปัญหาคุณธรรม', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '1 ก.ย. 2566'),
(92, 1, 'ท.', 'ภาษาไทย', 21, 1, 'คัดลายมือสื่อภาษาไทย', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(93, 1, 'ท.', 'ภาษาไทย', 21, 2, 'คัดลายมือสื่อภาษาไทย', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(94, 1, 'ท.', 'ภาษาไทย', 21, 3, 'คัดลายมือสื่อภาษาไทย', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(95, 1, 'ท.', 'ภาษาไทย', 22, 4, 'คัดลายมือสื่อภาษาไทย', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(96, 1, 'ท.', 'ภาษาไทย', 22, 5, 'คัดลายมือสื่อภาษาไทย', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(97, 1, 'ท.', 'ภาษาไทย', 21, 6, 'วรรณกรรมพิจารณ์', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(98, 1, 'ท.', 'ภาษาไทย', 22, 7, 'วรรณกรรมพิจารณ์', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(99, 1, 'ท.', 'ภาษาไทย', 22, 8, 'วรรณกรรมพิจารณ์', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(100, 1, 'ท.', 'ภาษาไทย', 21, 9, 'พินิจวรรณคดี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(101, 1, 'ท.', 'ภาษาไทย', 22, 10, 'พินิจวรรณคดี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(102, 1, 'ท.', 'ภาษาไทย', 22, 11, 'พินิจวรรณคดี', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(103, 1, 'ท.', 'ภาษาไทย', 21, 12, 'เรียงร้อยถ้อยความ (การเขียนเรื่องจากภาพ)', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(104, 1, 'ท.', 'ภาษาไทย', 21, 13, 'เรียงร้อยถ้อยความ (การเขียนเรียงความ)', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(105, 1, 'ท.', 'ภาษาไทย', 21, 14, 'เรียงร้อยถ้อยความ (การเขียนเรียงความ)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(106, 1, 'ท.', 'ภาษาไทย', 22, 15, 'เรียงร้อยถ้อยความ (การเขียนเรียงความ)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(107, 1, 'ท.', 'ภาษาไทย', 22, 16, 'เรียงร้อยถ้อยความ (การเขียนเรียงความ)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(108, 1, 'ท.', 'ภาษาไทย', 21, 17, 'ท่องอาขยานทำนองเสนาะ', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(109, 1, 'ท.', 'ภาษาไทย', 21, 18, 'ท่องอาขยานทำนองเสนาะ', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(110, 1, 'ท.', 'ภาษาไทย', 21, 19, 'ท่องอาขยานทำนองเสนาะ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(111, 1, 'ท.', 'ภาษาไทย', 21, 20, 'ท่องอาขยานทำนองเสนาะ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(112, 1, 'ท.', 'ภาษาไทย', 22, 21, 'ท่องอาขยานทำนองเสนาะ', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(113, 1, 'ท.', 'ภาษาไทย', 21, 22, 'กวีเยาวชนคนรุ่นใหม่ กลอนสี่ (๔ บท)', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(114, 1, 'ท.', 'ภาษาไทย', 21, 23, 'กวีเยาวชนคนรุ่นใหม่ กาพย์ยานี ๑๑ (๖ บท)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(115, 1, 'ท.', 'ภาษาไทย', 22, 24, 'กวีเยาวชนคนรุ่นใหม่ กาพย์ยานี ๑๑ (๖ บท)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(116, 1, 'ท.', 'ภาษาไทย', 22, 25, 'กวีเยาวชนคนรุ่นใหม่ โคลงสี่สุภาพ (๔ บท)', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(117, 1, 'ท.', 'ภาษาไทย', 21, 26, 'ต่อคำศัพท์ภาษาไทย (คำคมเดิม)', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(118, 1, 'ท.', 'ภาษาไทย', 21, 27, 'ต่อคำศัพท์ภาษาไทย (คำคมเดิม)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(119, 1, 'ท.', 'ภาษาไทย', 22, 28, 'ต่อคำศัพท์ภาษาไทย (คำคมเดิม)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(120, 1, 'ท.', 'ภาษาไทย', 22, 29, 'ต่อคำศัพท์ภาษาไทย (คำคมเดิม)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(121, 2, 'ค.', 'คณิตศาสตร์', 21, 30, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(122, 2, 'ค.', 'คณิตศาสตร์', 21, 31, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(123, 2, 'ค.', 'คณิตศาสตร์', 21, 32, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(124, 2, 'ค.', 'คณิตศาสตร์', 22, 33, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(125, 2, 'ค.', 'คณิตศาสตร์', 22, 34, 'การแข่งขันอัจฉริยภาพทางคณิตศาสตร์ ', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(126, 2, 'ค.', 'คณิตศาสตร์', 21, 35, 'การประกวดโครงงานคณิตศาสตร์ ประเภทสร้างทฤษฎีหรือคำอธิบาย ทางคณิตศาสตร์', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(127, 2, 'ค.', 'คณิตศาสตร์', 21, 36, 'การประกวดโครงงานคณิตศาสตร์ ประเภทสร้างทฤษฎีหรือคำอธิบาย ทางคณิตศาสตร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(128, 2, 'ค.', 'คณิตศาสตร์', 22, 37, 'การประกวดโครงงานคณิตศาสตร์ ประเภทสร้างทฤษฎีหรือคำอธิบาย ทางคณิตศาสตร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(129, 2, 'ค.', 'คณิตศาสตร์', 22, 38, 'การประกวดโครงงานคณิตศาสตร์ ประเภทสร้างทฤษฎีหรือคำอธิบาย ทางคณิตศาสตร์', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(130, 2, 'ค.', 'คณิตศาสตร์', 21, 39, 'การประกวดโครงงานคณิตศาสตร์ ประเภทบูรณาการความรู้ในคณิตศาสตร์ ไปประยุกต์ใช้', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(131, 2, 'ค.', 'คณิตศาสตร์', 21, 40, 'การประกวดโครงงานคณิตศาสตร์ ประเภทบูรณาการความรู้ในคณิตศาสตร์ ไปประยุกต์ใช้', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(132, 2, 'ค.', 'คณิตศาสตร์', 22, 41, 'การประกวดโครงงานคณิตศาสตร์ ประเภทบูรณาการความรู้ในคณิตศาสตร์ ไปประยุกต์ใช้', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(133, 2, 'ค.', 'คณิตศาสตร์', 22, 42, 'การประกวดโครงงานคณิตศาสตร์ ประเภทบูรณาการความรู้ในคณิตศาสตร์ ไปประยุกต์ใช้', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(134, 2, 'ค.', 'คณิตศาสตร์', 21, 43, 'การแข่งขันสร้างสรรค์ผลงาน คณิตศาสตร์โดยใช้โปรแกรม GSP', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(135, 2, 'ค.', 'คณิตศาสตร์', 21, 44, 'การแข่งขันสร้างสรรค์ผลงาน คณิตศาสตร์โดยใช้โปรแกรม GSP', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(136, 2, 'ค.', 'คณิตศาสตร์', 22, 45, 'การแข่งขันสร้างสรรค์ผลงาน คณิตศาสตร์โดยใช้โปรแกรม GSP', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(137, 2, 'ค.', 'คณิตศาสตร์', 22, 46, 'การแข่งขันสร้างสรรค์ผลงาน คณิตศาสตร์โดยใช้โปรแกรม GSP', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(138, 2, 'ค.', 'คณิตศาสตร์', 21, 47, 'การแข่งขันคิดเลขเร็ว', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(139, 2, 'ค.', 'คณิตศาสตร์', 21, 48, 'การแข่งขันคิดเลขเร็ว', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(140, 2, 'ค.', 'คณิตศาสตร์', 21, 49, 'การแข่งขันคิดเลขเร็ว', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(141, 2, 'ค.', 'คณิตศาสตร์', 22, 50, 'การแข่งขันคิดเลขเร็ว', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(142, 2, 'ค.', 'คณิตศาสตร์', 22, 51, 'การแข่งขันคิดเลขเร็ว', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(143, 2, 'ค.', 'คณิตศาสตร์', 21, 52, 'การแข่งขันต่อสมการคณิตศาสตร์ (เอแม็ท)', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(144, 2, 'ค.', 'คณิตศาสตร์', 21, 53, 'การแข่งขันต่อสมการคณิตศาสตร์ (เอแม็ท)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(145, 2, 'ค.', 'คณิตศาสตร์', 22, 54, 'การแข่งขันต่อสมการคณิตศาสตร์ (เอแม็ท)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(146, 2, 'ค.', 'คณิตศาสตร์', 22, 55, 'การแข่งขันต่อสมการคณิตศาสตร์ (เอแม็ท)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(147, 2, 'ค.', 'คณิตศาสตร์', 21, 56, 'การแข่งขันซูโดกุ', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(148, 2, 'ค.', 'คณิตศาสตร์', 21, 57, 'การแข่งขันซูโดกุ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(149, 2, 'ค.', 'คณิตศาสตร์', 22, 58, 'การแข่งขันซูโดกุ', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(150, 2, 'ค.', 'คณิตศาสตร์', 22, 59, 'การแข่งขันซูโดกุ', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(151, 2, 'ค.', 'คณิตศาสตร์', 21, 60, 'การแข่งขันเวทคณิต', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(152, 2, 'ค.', 'คณิตศาสตร์', 21, 61, 'การแข่งขันเวทคณิต', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(153, 2, 'ค.', 'คณิตศาสตร์', 21, 62, 'การแข่งขันเวทคณิต', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(154, 2, 'ค.', 'คณิตศาสตร์', 22, 63, 'การแข่งขันเวทคณิต', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(155, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 64, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(156, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 65, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(157, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 66, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(158, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 67, 'การแข่งขันอัจฉริยภาพทางวิทยาศาสตร์', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(159, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 68, 'การประกวดโครงงานวิทยาศาสตร์ ประเภททดลอง', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(160, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 69, 'การประกวดโครงงานวิทยาศาสตร์ ประเภททดลอง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(161, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 70, 'การประกวดโครงงานวิทยาศาสตร์ ประเภททดลอง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(162, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 71, 'การประกวดโครงงานวิทยาศาสตร์ ประเภททดลอง', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(163, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 72, 'การประกวดโครงงานวิทยาศาสตร์ ประเภทสิ่งประดิษฐ์', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(164, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 73, 'การประกวดโครงงานวิทยาศาสตร์ ประเภทสิ่งประดิษฐ์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(165, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 74, 'การประกวดโครงงานวิทยาศาสตร์ ประเภทสิ่งประดิษฐ์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(166, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 75, 'การประกวดโครงงานวิทยาศาสตร์ ประเภทสิ่งประดิษฐ์', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(167, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 76, 'การแข่งขันการแสดงทางวิทยาศาสตร์ (Science Show)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(168, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 77, 'การแข่งขันการแสดงทางวิทยาศาสตร์ (Science Show)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(169, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 78, 'การแข่งขันการแสดงทางวิทยาศาสตร์ (Science Show)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(170, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 79, 'การแข่งขันการแสดงทางวิทยาศาสตร์ (Science Show)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(171, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 80, 'การประกวดผลงานสิ่งประดิษฐ์ทาง วิทยาศาสตร์', 6, 'ป.1-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(172, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 81, 'การประกวดผลงานสิ่งประดิษฐ์ทาง วิทยาศาสตร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(173, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 82, 'การประกวดผลงานสิ่งประดิษฐ์ทาง วิทยาศาสตร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(174, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 83, 'การประกวดผลงานสิ่งประดิษฐ์ทาง วิทยาศาสตร์', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(175, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 84, 'เครื่องร่อนแบบเดินตาม WALK ALONG GLIDER', 2, 'ป.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(176, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 85, 'การแข่งขันเครื่องร่อนประเภทร่อนนานยิงยาง', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(177, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 86, 'การแข่งขันเครื่องร่อน ประเภทร่อนนานปล่อยด้วยมือ', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(178, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 87, 'การแข่งขันเครื่องบินพลังยาง ประเภทสามมิติ (3D) ', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(179, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 88, 'การแข่งขันเครื่องบินพลังยาง ประเภทสามมิติ (3D) ', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(180, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 89, 'การแข่งขันเครื่องบินพลังยาง ประเภทบินนาน ปล่อยอิสระ', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(181, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 90, 'การแข่งขันเครื่องบินพลังยาง ประเภทบินนาน ปล่อยอิสระ', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(182, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 91, 'การแข่งขันอากาศยานบังคับด้วยวิทยุ ประเภทพิชิตเป้าหมาย', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(183, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 92, 'การแข่งขันการสร้างการ์ตูนด้วยโปรแกรมคอมพิวเตอร์กราฟิก', 2, 'ป.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(184, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 93, 'การแข่งขันการสร้างการ์ตูนเรื่องสั้น (Comic Strip)', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(185, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 94, 'การแข่งขันการสร้างการ์ตูนเรื่องสั้น (Comic Strip)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(186, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 95, 'การแข่งขันการสร้างการ์ตูนเรื่องสั้น (Comic Strip)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(187, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 96, 'การแข่งขันการสร้างการ์ตูนแอนิเมชั่น (๒D Animation)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(188, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 97, 'การแข่งขันการสร้างการ์ตูนแอนิเมชั่น (๒D Animation)', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(189, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 98, 'การแข่งขันการออกแบบสิ่งของเครื่องใช้ด้วยโปรแกรม คอมพิวเตอร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(190, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 99, 'การแข่งขันการออกแบบสิ่งของเครื่องใช้ด้วยโปรแกรม คอมพิวเตอร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(191, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 100, 'การแข่งขันการออกแบบสิ่งของเครื่องใช้ด้วยโปรแกรม คอมพิวเตอร์', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(192, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 101, 'การแข่งขันการสร้างเกมสร้างสรรค์จากคอมพิวเตอร์', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(193, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 102, 'การแข่งขันการสร้างเกมสร้างสรรค์จากคอมพิวเตอร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(194, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 103, 'การแข่งขันการสร้างเกมสร้างสรรค์จากคอมพิวเตอร์', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(195, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 104, 'การแข่งขันการสร้างเกมสร้างสรรค์จากคอมพิวเตอร์', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(196, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 105, 'การแข่งขัน Motion Infographic', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(197, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 106, 'การแข่งขันการใช้โปรแกรมนำเสนอ (Presentation)', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(198, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 107, 'การแข่งขันการสร้าง Webpage ประเภท Text Editor', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(199, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 108, 'การแข่งขันการสร้าง Webpage ประเภท Text Editor', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(200, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 109, 'การแข่งขันการสร้าง Webpage ประเภท Web Editor', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(201, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 110, 'การแข่งขันการสร้าง Webpage ประเภท Web Editor', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(202, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 111, 'การแข่งขันการสร้าง Webpage ประเภท Web Editor', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(203, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 112, 'การแข่งขันการสร้าง Web Applications', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(204, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 113, 'การแข่งขันการเขียนโปรแกรมด้วยภาษาคอมพิวเตอร์', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(205, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 114, 'การประกวดโครงงานคอมพิวเตอร์ประเภทซอฟต์แวร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(206, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 115, 'การประกวดโครงงานคอมพิวเตอร์ประเภทซอฟต์แวร์', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(207, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 116, 'การประกวดโครงงานคอมพิวเตอร์ประเภทซอฟต์แวร์', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(208, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 117, 'การแข่งขันการตัดต่อภาพยนตร์', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(209, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 118, 'หุ่นยนต์ระดับพื้นฐาน', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(210, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 119, 'หุ่นยนต์ระดับพื้นฐาน', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(211, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 120, 'หุ่นยนต์ระดับพื้นฐาน', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(212, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 121, 'หุ่นยนต์ระดับพื้นฐาน', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(213, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 122, 'หุ่นยนต์ระดับกลาง', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(214, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 123, 'หุ่นยนต์ระดับกลาง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(215, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 124, 'หุ่นยนต์ระดับกลาง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(216, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 125, 'หุ่นยนต์ระดับกลาง', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(217, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 126, 'หุ่นยนต์ระดับสูง', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(218, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 127, 'หุ่นยนต์ระดับสูง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(219, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 128, 'หุ่นยนต์ระดับสูง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(220, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 129, 'หุ่นยนต์ระดับสูง', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(221, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 130, 'หุ่นยนต์ระดับผสม', 3, 'ป.4-6', 4, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(222, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 21, 131, 'หุ่นยนต์ระดับผสม', 4, 'ม.1-3', 4, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(223, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 132, 'หุ่นยนต์ระดับผสม', 4, 'ม.1-3', 4, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(224, 3, 'ว.', 'วิทยาศาสตร์และเทคโนโลยี', 22, 133, 'หุ่นยนต์ระดับผสม', 5, 'ม.4-6', 4, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(225, 4, 'ส.', 'สังคมศึกษา', 21, 134, 'เพลงคุณธรรม', 2, 'ป.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(226, 4, 'ส.', 'สังคมศึกษา', 21, 135, 'เพลงคุณธรรม', 3, 'ป.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(227, 4, 'ส.', 'สังคมศึกษา', 21, 136, 'เพลงคุณธรรม', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(228, 4, 'ส.', 'สังคมศึกษา', 22, 137, 'เพลงคุณธรรม', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(229, 4, 'ส.', 'สังคมศึกษา', 22, 138, 'เพลงคุณธรรม', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(230, 4, 'ส.', 'สังคมศึกษา', 21, 139, 'โครงงานคุณธรรม', 2, 'ป.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(231, 4, 'ส.', 'สังคมศึกษา', 21, 140, 'โครงงานคุณธรรม', 3, 'ป.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(232, 4, 'ส.', 'สังคมศึกษา', 21, 141, 'โครงงานคุณธรรม', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(233, 4, 'ส.', 'สังคมศึกษา', 22, 142, 'โครงงานคุณธรรม', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(234, 4, 'ส.', 'สังคมศึกษา', 22, 143, 'โครงงานคุณธรรม', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(235, 4, 'ส.', 'สังคมศึกษา', 21, 144, 'การประกวดภาพยนตร์สั้น', 6, 'ป.1-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(236, 4, 'ส.', 'สังคมศึกษา', 21, 145, 'การประกวดภาพยนตร์สั้น', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(237, 4, 'ส.', 'สังคมศึกษา', 22, 146, 'การประกวดภาพยนตร์สั้น', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(238, 4, 'ส.', 'สังคมศึกษา', 22, 147, 'การประกวดภาพยนตร์สั้น', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(239, 4, 'ส.', 'สังคมศึกษา', 21, 148, 'ละครคุณธรรม', 8, 'ป.1-ม.3', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(240, 4, 'ส.', 'สังคมศึกษา', 22, 149, 'ละครคุณธรรม', 7, 'ม.1-6', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(241, 4, 'ส.', 'สังคมศึกษา', 21, 150, 'ละครประวัติศาสตร์', 8, 'ป.1-ม.3', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(242, 4, 'ส.', 'สังคมศึกษา', 22, 151, 'ละครประวัติศาสตร์', 7, 'ม.1-6', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(243, 4, 'ส.', 'สังคมศึกษา', 21, 152, 'เล่านิทานคุณธรรม', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(244, 4, 'ส.', 'สังคมศึกษา', 21, 153, 'เล่านิทานคุณธรรม', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(245, 4, 'ส.', 'สังคมศึกษา', 21, 154, 'เล่านิทานคุณธรรม', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(246, 4, 'ส.', 'สังคมศึกษา', 22, 155, 'เล่านิทานคุณธรรม', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(247, 4, 'ส.', 'สังคมศึกษา', 22, 156, 'เล่านิทานคุณธรรม', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(248, 4, 'ส.', 'สังคมศึกษา', 21, 157, 'มารยาทไทย', 2, 'ป.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(249, 4, 'ส.', 'สังคมศึกษา', 21, 158, 'มารยาทไทย', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(250, 4, 'ส.', 'สังคมศึกษา', 21, 159, 'มารยาทไทย', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(251, 4, 'ส.', 'สังคมศึกษา', 22, 160, 'มารยาทไทย', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(252, 4, 'ส.', 'สังคมศึกษา', 22, 161, 'มารยาทไทย', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(253, 4, 'ส.', 'สังคมศึกษา', 21, 162, 'สวดมนต์แปล (สวดบาลีแปลไทย)', 6, 'ป.1-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(254, 4, 'ส.', 'สังคมศึกษา', 21, 163, 'สวดมนต์แปล (สวดบาลีแปลอังกฤษ)', 4, 'ม.1-3', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(255, 4, 'ส.', 'สังคมศึกษา', 22, 164, 'สวดมนต์แปล (สวดบาลีแปลอังกฤษ)', 7, 'ม.1-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(256, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 165, 'การออกกำลังกายประกอบเพลง (แอโรบิค)', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(257, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 166, 'การออกกำลังกายประกอบเพลง (แอโรบิค)', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(258, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 167, 'การออกกำลังกายประกอบเพลง (แอโรบิค)', 7, 'ม.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(259, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 168, 'การออกกำลังกายประกอบเพลง (คีตะมวยไทย)', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(260, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 169, 'การออกกำลังกายประกอบเพลง (คีตะมวยไทย)', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(261, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 170, 'การออกกำลังกายประกอบเพลง (คีตะมวยไทย)', 7, 'ม.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(262, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 171, 'ทักษะพื้นฐานด้านกีฬา (มวย สากลสมัครเล่น)', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(263, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 172, 'ทักษะพื้นฐานด้านกีฬา (มวย สากลสมัครเล่น)', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(264, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 173, 'ทักษะพื้นฐานด้านกีฬา (มวย สากลสมัครเล่น)', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(265, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 174, 'ทักษะพื้นฐานด้านกีฬา (มวย สากลสมัครเล่น)', 5, 'ม.4-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(266, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 175, 'ตอบปัญหาสุขศึกษาและพลศึกษา', 6, 'ป.1-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(267, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 21, 176, 'ตอบปัญหาสุขศึกษาและพลศึกษา', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(268, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 177, 'ตอบปัญหาสุขศึกษาและพลศึกษา', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(269, 5, 'พ.', 'สุขศึกษาและพลศึกษา', 22, 178, 'ตอบปัญหาสุขศึกษาและพลศึกษา', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(270, 6, 'ศ.', 'ศิลปะ', 21, 179, 'การแข่งขันจิตรกรรมเทคนิคผสม Mixed Media', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(271, 6, 'ศ.', 'ศิลปะ', 21, 180, 'การแข่งขันจิตรกรรมเทคนิคผสม Mixed Media', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(272, 6, 'ศ.', 'ศิลปะ', 21, 181, 'การแข่งขันจิตรกรรมเทคนิคผสม Mixed Media', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(273, 6, 'ศ.', 'ศิลปะ', 22, 182, 'การแข่งขันจิตรกรรมเทคนิคผสม Mixed Media', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(274, 6, 'ศ.', 'ศิลปะ', 22, 183, 'การแข่งขันจิตรกรรมเทคนิคผสม Mixed Media', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(275, 6, 'ศ.', 'ศิลปะ', 21, 184, 'การแข่งขันวาดภาพระบายสี', 2, 'ป.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(276, 6, 'ศ.', 'ศิลปะ', 21, 185, 'การแข่งขันวาดภาพระบายสี', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(277, 6, 'ศ.', 'ศิลปะ', 21, 186, 'การแข่งขันวาดภาพระบายสี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(278, 6, 'ศ.', 'ศิลปะ', 22, 187, 'การแข่งขันวาดภาพระบายสี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(279, 6, 'ศ.', 'ศิลปะ', 22, 188, 'การแข่งขันวาดภาพระบายสี', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(280, 6, 'ศ.', 'ศิลปะ', 21, 189, 'การแข่งขันเขียนภาพไทยประเพณี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(281, 6, 'ศ.', 'ศิลปะ', 22, 190, 'การแข่งขันเขียนภาพไทยประเพณี', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(282, 6, 'ศ.', 'ศิลปะ', 22, 191, 'การแข่งขันเขียนภาพไทยประเพณี', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(283, 6, 'ศ.', 'ศิลปะ', 21, 192, 'การแข่งขันเขียนภาพจิตรกรรมไทยสีเอกรงค์', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(284, 6, 'ศ.', 'ศิลปะ', 22, 193, 'การแข่งขันเขียนภาพจิตรกรรมไทยสีเอกรงค์', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(285, 6, 'ศ.', 'ศิลปะ', 22, 194, 'การแข่งขันเขียนภาพจิตรกรรมไทยสีเอกรงค์', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(286, 6, 'ศ.', 'ศิลปะ', 21, 195, 'การสร้างสรรค์ภาพด้วยการปะติด', 2, 'ป.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(287, 6, 'ศ.', 'ศิลปะ', 21, 196, 'การสร้างสรรค์ภาพด้วยการปะติด', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(288, 6, 'ศ.', 'ศิลปะ', 21, 197, 'การสร้างสรรค์ภาพด้วยการปะติด', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(289, 6, 'ศ.', 'ศิลปะ', 22, 198, 'การสร้างสรรค์ภาพด้วยการปะติด', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(290, 6, 'ศ.', 'ศิลปะ', 21, 199, 'การแข่งขันวาดภาพลายเส้น', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(291, 6, 'ศ.', 'ศิลปะ', 22, 200, 'การแข่งขันวาดภาพลายเส้น', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(292, 6, 'ศ.', 'ศิลปะ', 22, 201, 'การแข่งขันวาดภาพลายเส้น', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(293, 6, 'ศ.', 'ศิลปะ', 21, 202, 'การแข่งขันประติมากรรม', 2, 'ป.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(294, 6, 'ศ.', 'ศิลปะ', 21, 203, 'การแข่งขันประติมากรรม', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(295, 6, 'ศ.', 'ศิลปะ', 21, 204, 'การแข่งขันประติมากรรม', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(296, 6, 'ศ.', 'ศิลปะ', 22, 205, 'การแข่งขันประติมากรรม', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(297, 6, 'ศ.', 'ศิลปะ', 22, 206, 'การแข่งขันประติมากรรม', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(298, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 207, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดเอก)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(299, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 208, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดเอก)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(300, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 209, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดเอก)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(301, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 210, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดเอก)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(302, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 211, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดทุ้ม)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(303, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 212, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดทุ้ม)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(304, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 213, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดทุ้ม)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(305, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 214, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวระนาดทุ้ม)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(306, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 215, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงใหญ่)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(307, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 216, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงใหญ่)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(308, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 217, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงใหญ่)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(309, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 218, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงใหญ่)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(310, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 219, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงเล็ก)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(311, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 220, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงเล็ก)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(312, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 221, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงเล็ก)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(313, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 222, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวฆ้องวงเล็ก)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(314, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 223, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซอด้วง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(315, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 224, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซอด้วง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(316, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 225, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซอด้วง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(317, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 226, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซอด้วง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(318, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 227, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซออู)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(319, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 228, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซออู)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(320, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 229, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซออู)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(321, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 230, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวซออู)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(322, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 231, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวจะเข้)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(323, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 232, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวจะเข้)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(324, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 233, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวจะเข้)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(325, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 234, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวจะเข้)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(326, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 235, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขิม 7 หย่อง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(327, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 236, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขิม 7 หย่อง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(328, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 237, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขิม 7 หย่อง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(329, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 238, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขิม 7 หย่อง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(330, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 239, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขลุ่ยเพียงออ)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(331, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 240, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขลุ่ยเพียงออ)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(332, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 241, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขลุ่ยเพียงออ)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(333, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 242, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (เดี่ยวขลุ่ยเพียงออ)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(334, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 243, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (ขับร้องเพลงไทย)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(335, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 244, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (ขับร้องเพลงไทย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(336, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 245, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (ขับร้องเพลงไทย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(337, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 246, 'การแข่งขันเดี่ยวดนตรีไทยและขับร้อง (ขับร้องเพลงไทย)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(338, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 247, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมขิม)', 6, 'ป.1-6', 9, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(339, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 248, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมขิม)', 4, 'ม.1-3', 9, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(340, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 249, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมขิม)', 7, 'ม.1-6', 9, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(341, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 250, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมปี่พาทย์ไม้นวม)', 6, 'ป.1-6', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(342, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 251, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมปี่พาทย์ไม้นวม)', 4, 'ม.1-3', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(343, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 252, 'การแข่งขันวงดนตรีไทย (วงเครื่องสายผสมปี่พาทย์ไม้นวม)', 7, 'ม.1-6', 15, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(344, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 253, 'การแข่งขันวงดนตรีไทย (วงปี่พาทย์ไม้แข็ง)', 6, 'ป.1-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(345, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 254, 'การแข่งขันวงดนตรีไทย (วงปี่พาทย์ไม้แข็ง)', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(346, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 255, 'การแข่งขันวงดนตรีไทย (วงปี่พาทย์ไม้แข็ง)', 7, 'ม.1-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(347, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 256, 'การแข่งขันวงดนตรีไทย (วงอังกะลุง)', 6, 'ป.1-6', 20, 5, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(348, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 257, 'การแข่งขันวงดนตรีไทย (วงอังกะลุง)', 4, 'ม.1-3', 20, 5, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(349, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 258, 'การแข่งขันวงดนตรีไทย (วงอังกะลุง)', 7, 'ม.1-6', 20, 5, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(350, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 259, 'การแข่งขันวงดนตรีสตริง', 4, 'ม.1-3', 6, 3, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(351, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 260, 'การแข่งขันวงดนตรีสตริง', 4, 'ม.1-3', 6, 3, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(352, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 261, 'การแข่งขันวงดนตรีสตริง', 5, 'ม.4-6', 6, 3, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(353, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 262, 'การแข่งขันวงดนตรีลูกทุ่ง (ประเภททีม ก)', 8, 'ป.1-ม.3', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(354, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 263, 'การแข่งขันวงดนตรีลูกทุ่ง (ประเภททีม ก)', 7, 'ม.1-6', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(355, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 264, 'การแข่งขันวงดนตรีลูกทุ่ง (ประเภททีม ข)', 8, 'ป.1-ม.3', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(356, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 265, 'การแข่งขันวงดนตรีลูกทุ่ง (ประเภททีม ข)', 7, 'ม.1-6', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(357, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 266, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (ชาย)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(358, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 267, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(359, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 268, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(360, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 269, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (ชาย)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(361, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 270, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (หญิง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(362, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 271, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(363, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 272, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(364, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 273, 'การแข่งขันขับร้องเพลงไทยลูกทุ่ง (หญิง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(365, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 274, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (ชาย)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(366, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 275, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(367, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 276, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(368, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 277, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (ชาย)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(369, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 278, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (หญิง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(370, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 279, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(371, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 280, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566');
INSERT INTO `wp_groupsara` (`ID`, `group_id`, `group_nicename`, `group_name`, `group_status`, `activity_id`, `activity_name`, `class_id`, `class_name`, `student_no`, `teacher_no`, `location`, `match_time`, `match_date`) VALUES
(372, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 281, 'การแข่งขันขับร้องเพลงไทยลูกกรุง (หญิง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(373, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 282, 'การแข่งขันขับร้องเพลงสากล (ชาย)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(374, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 283, 'การแข่งขันขับร้องเพลงสากล (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(375, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 284, 'การแข่งขันขับร้องเพลงสากล (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(376, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 285, 'การแข่งขันขับร้องเพลงสากล (ชาย)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(377, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 286, 'การแข่งขันขับร้องเพลงสากล (หญิง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(378, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 287, 'การแข่งขันขับร้องเพลงสากล (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(379, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 288, 'การแข่งขันขับร้องเพลงสากล (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(380, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 289, 'การแข่งขันขับร้องเพลงสากล (หญิง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(381, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 290, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (ชาย)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(382, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 291, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(383, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 292, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (ชาย)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(384, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 293, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (ชาย)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(385, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 294, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (หญิง)', 6, 'ป.1-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(386, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 295, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(387, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 296, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (หญิง)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(388, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 297, 'การแข่งขันขับร้องเพลงพระราชนิพนธ์ (หญิง)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(389, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 298, 'การประกวดดนตรีประเภทวงดุริยางค์เครื่องลม (Wind Ensembles)', 6, 'ป.1-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(390, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 299, 'การประกวดดนตรีประเภทวงดุริยางค์เครื่องลม (Wind Ensembles)', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(391, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 300, 'การประกวดดนตรีประเภทวงดุริยางค์เครื่องลม (Wind Ensembles)', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(392, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 301, 'การประกวดดนตรีประเภทวงดุริยางค์เครื่องลม (Wind Ensembles)', 5, 'ม.4-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(393, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 302, 'การประกวดขับขานประสานเสียง', 6, 'ป.1-6', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(394, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 303, 'การประกวดขับขานประสานเสียง', 4, 'ม.1-3', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(395, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 304, 'การประกวดขับขานประสานเสียง', 4, 'ม.1-3', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(396, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 305, 'การประกวดขับขานประสานเสียง', 5, 'ม.4-6', 40, 8, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(397, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 306, 'การแข่งขันรำวงมาตรฐาน', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(398, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 307, 'การแข่งขันรำวงมาตรฐาน', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(399, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 308, 'การแข่งขันรำวงมาตรฐาน', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(400, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 309, 'การแข่งขันรำวงมาตรฐาน', 5, 'ม.4-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(401, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 310, 'การแข่งขันระบำมาตรฐาน', 6, 'ป.1-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(402, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 311, 'การแข่งขันระบำมาตรฐาน', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(403, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 312, 'การแข่งขันระบำมาตรฐาน', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(404, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 313, 'การแข่งขันระบำมาตรฐาน', 5, 'ม.4-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(405, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 314, 'การแข่งขันนาฏศิลป์ไทยอนุรักษ์', 6, 'ป.1-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(406, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 315, 'การแข่งขันนาฏศิลป์ไทยอนุรักษ์', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(407, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 316, 'การแข่งขันนาฏศิลป์ไทยอนุรักษ์', 4, 'ม.1-3', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(408, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 317, 'การแข่งขันนาฏศิลป์ไทยอนุรักษ์', 5, 'ม.4-6', 12, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(409, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 318, 'การแข่งขันนาฏศิลป์ไทยสร้างสรรค์', 6, 'ป.1-6', 16, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(410, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 319, 'การแข่งขันนาฏศิลป์ไทยสร้างสรรค์', 4, 'ม.1-3', 16, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(411, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 320, 'การแข่งขันนาฏศิลป์ไทยสร้างสรรค์', 4, 'ม.1-3', 16, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(412, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 321, 'การแข่งขันนาฏศิลป์ไทยสร้างสรรค์', 5, 'ม.4-6', 16, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(413, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 322, 'การแข่งขันการแสดงตลก', 8, 'ป.1-ม.3', 5, 3, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(414, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 323, 'การแข่งขันการแสดงตลก', 7, 'ม.1-6', 5, 3, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(415, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 21, 324, 'การแข่งขันมายากล', 8, 'ป.1-ม.3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(416, 6, 'ศ.', 'ศิลปะ (ดนตรี)', 22, 325, 'การแข่งขันมายากล', 7, 'ม.1-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(417, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 326, 'การแข่งขันพูดภาษาอังกฤษ (Impromptu Speech)', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(418, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 327, 'การแข่งขันพูดภาษาอังกฤษ (Impromptu Speech)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(419, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 328, 'การแข่งขันพูดภาษาอังกฤษ (Impromptu Speech)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(420, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 329, 'การแข่งขันพูดภาษาอังกฤษ (Impromptu Speech)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(421, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 330, 'การแข่งขันการเล่านิทาน (Story Telling)', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(422, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 331, 'การแข่งขันการเล่านิทาน (Story Telling)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(423, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 332, 'การแข่งขันการเล่านิทาน (Story Telling)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(424, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 333, 'การแข่งขันการเล่านิทาน (Story Telling)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(425, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 334, 'การเขียนเรื่องสั้นภาษาอังกฤษประกอบภาพ (Pictorial Writing)', 3, 'ป.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(426, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 335, 'การเขียนเรื่องสั้นภาษาอังกฤษประกอบภาพ (Pictorial Writing)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(427, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 336, 'การเขียนเรื่องสั้นภาษาอังกฤษประกอบภาพ (Pictorial Writing)', 4, 'ม.1-3', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(428, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 337, 'การเขียนเรื่องสั้นภาษาอังกฤษประกอบภาพ (Pictorial Writing)', 5, 'ม.4-6', 1, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(429, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 338, 'การแข่งขันพูด-ภาษาจีน', 3, 'ป.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(430, 8, 'อ.', 'ภาษาต่างประเทศ', 21, 339, 'การแข่งขันพูด-ภาษาจีน', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(431, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 340, 'การแข่งขันพูด-ภาษาจีน', 4, 'ม.1-3', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(432, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 341, 'การแข่งขันพูด-ภาษาจีน', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(433, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 342, 'การแข่งขันเล่าเรื่องจากภาพ-ภาษาจีน', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(434, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 343, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาญี่ปุ่น ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(435, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 344, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาเกาหลี ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(436, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 345, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาฝรั่งเศส ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(437, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 346, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาเยอรมัน ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(438, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 347, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาสเปน ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(439, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 348, 'การแข่งขันพูดเพื่ออาชีพ-ภาษารัสเซีย ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(440, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 349, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาเมียนมา ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(441, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 350, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาเวียดนาม ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(442, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 351, 'การแข่งขันพูดเพื่ออาชีพ-ภาษาเขมร ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(443, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 352, 'การแข่งขันพูดเพื่ออาชีพ-ภาษามลายู ', 5, 'ม.4-6', 2, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(444, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 353, 'การแข่งขันละครสั้น-ภาษาญี่ปุ่น ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(445, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 354, 'การแข่งขันละครสั้น-ภาษาเกาหลี ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(446, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 355, 'การแข่งขันละครสั้น-ภาษาฝรั่งเศส ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(447, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 356, 'การแข่งขันละครสั้น-ภาษาเยอรมัน ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(448, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 357, 'การแข่งขันละครสั้น-ภาษาสเปน ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(449, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 358, 'การแข่งขันละครสั้น-ภาษารัสเซีย ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(450, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 359, 'การแข่งขันละครสั้น-ภาษาเมียนมา ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(451, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 360, 'การแข่งขันละครสั้น-ภาษาเวียดนาม ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(452, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 361, 'การแข่งขันละครสั้น-ภาษาเขมร ', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(453, 8, 'อ.', 'ภาษาต่างประเทศ', 22, 362, 'การแข่งขันละครสั้น-ภาษามลายู', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(454, 7, 'ง.', 'การงานอาชีพ', 21, 363, 'การแข่งขันประดิษฐ์ของใช้จากวัสดุ ธรรมชาติในท้องถิ่น', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(455, 7, 'ง.', 'การงานอาชีพ', 21, 364, 'การแข่งขันประดิษฐ์ของใช้จากวัสดุ ธรรมชาติในท้องถิ่น', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(456, 7, 'ง.', 'การงานอาชีพ', 22, 365, 'การแข่งขันประดิษฐ์ของใช้จากวัสดุ ธรรมชาติในท้องถิ่น', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(457, 7, 'ง.', 'การงานอาชีพ', 22, 366, 'การแข่งขันประดิษฐ์ของใช้จากวัสดุ ธรรมชาติในท้องถิ่น', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(458, 7, 'ง.', 'การงานอาชีพ', 21, 367, 'การแข่งขันจักสานไม้ไผ่', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(459, 7, 'ง.', 'การงานอาชีพ', 21, 368, 'การแข่งขันจักสานไม้ไผ่', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(460, 7, 'ง.', 'การงานอาชีพ', 22, 369, 'การแข่งขันจักสานไม้ไผ่', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(461, 7, 'ง.', 'การงานอาชีพ', 22, 370, 'การแข่งขันจักสานไม้ไผ่', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(462, 7, 'ง.', 'การงานอาชีพ', 21, 371, 'การแข่งขันประดิษฐ์ดอกไม้ใบตอง (พานพุ่มสักการะ)', 3, 'ป.4-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(463, 7, 'ง.', 'การงานอาชีพ', 21, 372, 'การแข่งขันประดิษฐ์ดอกไม้ใบตอง (กระทงดอกไม้ธูปเทียนแพ)', 4, 'ม.1-3', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(464, 7, 'ง.', 'การงานอาชีพ', 22, 373, 'การแข่งขันประดิษฐ์ดอกไม้ใบตอง (กระทงดอกไม้ธูปเทียนแพ)', 4, 'ม.1-3', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(465, 7, 'ง.', 'การงานอาชีพ', 22, 374, 'การแข่งขันประดิษฐ์ดอกไม้ใบตอง (บายศรีสู่ขวัญ)', 5, 'ม.4-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(466, 7, 'ง.', 'การงานอาชีพ', 21, 375, 'การประกวดโครงงานอาชีพ', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(467, 7, 'ง.', 'การงานอาชีพ', 21, 376, 'การประกวดโครงงานอาชีพ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(468, 7, 'ง.', 'การงานอาชีพ', 22, 377, 'การประกวดโครงงานอาชีพ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(469, 7, 'ง.', 'การงานอาชีพ', 22, 378, 'การประกวดโครงงานอาชีพ', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(470, 7, 'ง.', 'การงานอาชีพ', 21, 379, 'การแข่งขันจัดสวนถาด (การจัดสวนถาดแบบแห้ง)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(471, 7, 'ง.', 'การงานอาชีพ', 21, 380, 'การแข่งขันจัดสวนถาด (การจัดสวนถาดแบบชื้น)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(472, 7, 'ง.', 'การงานอาชีพ', 22, 381, 'การแข่งขันจัดสวนถาด (การจัดสวนถาดแบบชื้น)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(473, 7, 'ง.', 'การงานอาชีพ', 22, 382, 'การแข่งขันจัดสวนถาด (การจัดสวนแก้ว)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(474, 7, 'ง.', 'การงานอาชีพ', 21, 383, 'การประกวดแปรรูปอาหาร', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(475, 7, 'ง.', 'การงานอาชีพ', 21, 384, 'การประกวดแปรรูปอาหาร', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(476, 7, 'ง.', 'การงานอาชีพ', 22, 385, 'การประกวดแปรรูปอาหาร', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(477, 7, 'ง.', 'การงานอาชีพ', 22, 386, 'การประกวดแปรรูปอาหาร', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(478, 7, 'ง.', 'การงานอาชีพ', 21, 387, 'การแข่งขันทำอาหาร น้ำพริก ผักสด เครื่องเคียง', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(479, 7, 'ง.', 'การงานอาชีพ', 21, 388, 'การแข่งขันทำอาหาร น้ำพริก ผักสด เครื่องเคียง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(480, 7, 'ง.', 'การงานอาชีพ', 22, 389, 'การแข่งขันทำอาหาร น้ำพริก ผักสด เครื่องเคียง', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(481, 7, 'ง.', 'การงานอาชีพ', 22, 390, 'การแข่งขันทำอาหาร น้ำพริก ผักสด เครื่องเคียง', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(482, 7, 'ง.', 'การงานอาชีพ', 21, 391, 'การแข่งขันทำอาหารคาวหวาน เพื่อสุขภาพ', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(483, 7, 'ง.', 'การงานอาชีพ', 21, 392, 'การแข่งขันทำอาหารคาวหวาน เพื่อสุขภาพ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(484, 7, 'ง.', 'การงานอาชีพ', 22, 393, 'การแข่งขันทำอาหารคาวหวาน เพื่อสุขภาพ', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(485, 7, 'ง.', 'การงานอาชีพ', 22, 394, 'การแข่งขันทำอาหารคาวหวาน เพื่อสุขภาพ', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(486, 7, 'ง.', 'การงานอาชีพ', 21, 395, 'การแข่งขันแกะสลักผักและผลไม้', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(487, 7, 'ง.', 'การงานอาชีพ', 21, 396, 'การแข่งขันแกะสลักผักและผลไม้', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(488, 7, 'ง.', 'การงานอาชีพ', 22, 397, 'การแข่งขันแกะสลักผักและผลไม้', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(489, 7, 'ง.', 'การงานอาชีพ', 22, 398, 'การแข่งขันแกะสลักผักและผลไม้', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(490, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 399, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การผูกเงื่อน เดินทรงตัวและโยนบอล)', 2, 'ป.1-3', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(491, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 400, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การใช้เข็มทิศและการคาดคะเนและสะกดรอย)', 3, 'ป.4-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(492, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 401, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การจัดการค่ายพักแรม)', 4, 'ม.1-3', 8, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(493, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 402, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การจัดการค่ายพักแรม)', 4, 'ม.1-3', 8, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(494, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 403, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การสร้างอุปกรณ์เพื่อให้บริการ)', 5, 'ม.4-6', 6, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(495, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 404, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การเต้นประกอบเพลง Cover Dance Contest (ลูกเสือต้านภัยยาเสพติด))', 2, 'ป.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(496, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 405, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การเต้นประกอบเพลง Cover Dance Contest (ลูกเสือต้านภัยยาเสพติด))', 3, 'ป.4-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(497, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 406, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การเต้นประกอบเพลง Cover Dance Contest (ลูกเสือต้านภัยยาเสพติด))', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(498, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 407, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การเต้นประกอบเพลง Cover Dance Contest (ลูกเสือต้านภัยยาเสพติด))', 4, 'ม.1-3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(499, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 408, 'กิจกรรมลูกเสือ เนตรนารี ยุวกาชาดผู้บำเพ็ญประโยชน์ (การเต้นประกอบเพลง Cover Dance Contest (ลูกเสือต้านภัยยาเสพติด))', 5, 'ม.4-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(500, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 409, 'กิจกรรมยุวกาชาด (คหกรรม )', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(501, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 410, 'กิจกรรมยุวกาชาด (การปฐมพยาบาล)', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(502, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 411, 'กิจกรรมยุวกาชาด (การปฐมพยาบาล)', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(503, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 412, 'กิจกรรมสภานักเรียน', 6, 'ป.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(504, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 413, 'กิจกรรมสภานักเรียน', 8, 'ป.1-ม.3', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(505, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 414, 'กิจกรรมสภานักเรียน', 7, 'ม.1-6', 10, 4, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(506, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 415, 'กิจกรรมนักเรียนเพื่อนที่ปรึกษา(YC : Youth Counselor)', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(507, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 416, 'กิจกรรมนักเรียนเพื่อนที่ปรึกษา(YC : Youth Counselor)', 4, 'ม.1-3', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(508, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 417, 'กิจกรรมนักเรียนเพื่อนที่ปรึกษา(YC : Youth Counselor)', 5, 'ม.4-6', 5, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(509, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 418, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันการทำหนังสือเล่มเล็ก)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(510, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 419, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันการทำหนังสือเล่มเล็ก)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(511, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 420, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันการทำหนังสือเล่มเล็ก)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(512, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 421, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันการทำหนังสือเล่มเล็ก)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(513, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 422, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันยุวบรรณารักษ์ส่งเสริมการอ่าน)', 3, 'ป.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(514, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 21, 423, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันยุวบรรณารักษ์ส่งเสริมการอ่าน)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(515, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 424, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันยุวบรรณารักษ์ส่งเสริมการอ่าน)', 4, 'ม.1-3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(516, 9, 'ก.', 'กิจกรรมพัฒนาผู้เรียน', 22, 425, 'กิจกรรมส่งเสริมนิสัยรักการอ่าน (การแข่งขันยุวบรรณารักษ์ส่งเสริมการอ่าน)', 5, 'ม.4-6', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(517, 10, 'ป.', 'ปฐมวัย', 21, 426, 'การปั้นดินน้ำมัน', 1, 'อนุบาล 3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566'),
(518, 10, 'ป.', 'ปฐมวัย', 21, 427, 'การสร้างภาพด้ว ยการฉีก ตัด ปะ กระดาษ', 1, 'อนุบาล 3', 3, 2, NULL, '08.30น.-12.00น.', '2 ก.ย. 2566');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `wp_schools`
--

CREATE TABLE `wp_schools` (
  `ID` bigint UNSIGNED NOT NULL,
  `school_id` bigint UNSIGNED NOT NULL COMMENT 'รหัสโรงเรียน10หลัก',
  `school_nicename` varchar(50) COLLATE utf8mb4_unicode_520_ci DEFAULT '' COMMENT 'ชื่อย่อ',
  `school_name` varchar(100) COLLATE utf8mb4_unicode_520_ci DEFAULT '' COMMENT 'ชื่อโรงเรียน',
  `go_id` bigint UNSIGNED DEFAULT NULL COMMENT 'รหัสหน่วยงานต้นสังกัด',
  `go_name` varchar(100) COLLATE utf8mb4_unicode_520_ci DEFAULT '' COMMENT 'ชื่อหน่วยงานต้นสังกัด',
  `school_status` int DEFAULT '0' COMMENT 'สถานะ',
  `city` varchar(50) COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'อำเภอ',
  `province` varchar(50) COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'จังหวัด',
  `display_name` varchar(250) COLLATE utf8mb4_unicode_520_ci DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_520_ci;

--
-- dump ตาราง `wp_schools`
--

INSERT INTO `wp_schools` (`ID`, `school_id`, `school_nicename`, `school_name`, `go_id`, `go_name`, `school_status`, `city`, `province`, `display_name`) VALUES
(1, 3041200101, 'ท.1', 'เทศบาล 1 โพศรี', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(2, 3041200102, 'ท.2', 'เทศบาล 2 มุขมนตรี', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(3, 3041200103, 'ท.3', 'เทศบาล 3 บ้านเหล่า', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(4, 3041200104, 'ท.4', 'เทศบาล 4 วัดโพธิวราราม', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(5, 3041200105, 'ท.5', 'เทศบาล 5 สีหรักษ์วิทยา', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(6, 3041200106, 'ท.6', 'มัธยมเทศบาล 6 นครอุดรธานี', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(7, 3041200107, 'ท.7', 'เทศบาล 7 รถไฟสงเคราะห์', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(8, 3041200108, 'ท.8', 'ไทยรัฐวิทยา 72 (เทศบาล 8)', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(9, 3041200109, 'ท.9', 'เทศบาล 9 มณเฑียรทองอนุสรณ์', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(10, 3041200110, 'ท.10', 'เทศบาล 10 อนุบาลหนูดี', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(11, 3041200111, 'ท.11', 'เทศบาล 11 หนองหิน', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, ''),
(12, 3041200112, 'ท.12', 'เทศบาล 12 บ้านช้าง', 3401200101, 'เทศบาลนครอุดรธานี', 0, NULL, NULL, '');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `wp_studentreg`
--

CREATE TABLE `wp_studentreg` (
  `ID` int NOT NULL,
  `reg_id` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `school_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'รหัสโรงเรียน10หลัก',
  `go_id` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'รหัสหน่วยงานต้นสังกัด',
  `groupsara_id` int NOT NULL COMMENT 'ID tbl wp_groupsara',
  `activity_id` int NOT NULL COMMENT 'รหัสกิจกรรม',
  `class_id` int NOT NULL COMMENT 'รหัสระดับ',
  `reg_status` int DEFAULT NULL COMMENT 'สถานะสมัคร',
  `student_prefix` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'คำนำหน้า',
  `student_firstname` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ชื่อ',
  `student_lastname` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'นามสกุล',
  `display_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `student_image` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'รูปภาพ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- dump ตาราง `wp_studentreg`
--

INSERT INTO `wp_studentreg` (`ID`, `reg_id`, `school_id`, `go_id`, `groupsara_id`, `activity_id`, `class_id`, `reg_status`, `student_prefix`, `student_firstname`, `student_lastname`, `display_name`, `student_image`) VALUES
(37, '2023-08-23 10:34:28', '3041200101', '3401200101', 19, 19, 2, NULL, 'ด.ช.', 'ชาย', 'สกุลชาย', NULL, NULL),
(38, '2023-08-23 10:34:28', '3041200101', '3401200101', 19, 19, 2, NULL, 'ด.ญ.', 'หญิง', 'สกุลหญิง', NULL, NULL);

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `wp_teacherreg`
--

CREATE TABLE `wp_teacherreg` (
  `ID` int UNSIGNED NOT NULL,
  `reg_id` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `school_id` varchar(30) COLLATE utf8mb4_unicode_520_ci NOT NULL COMMENT 'รหัสโรงเรียน10หลัก',
  `go_id` varchar(30) COLLATE utf8mb4_unicode_520_ci NOT NULL COMMENT 'รหัสหน่วยงานต้นสังกัด',
  `groupsara_id` int NOT NULL,
  `activity_id` int NOT NULL COMMENT 'รหัสกิจกรรม',
  `class_id` int NOT NULL COMMENT 'รหัสระดับ',
  `reg_status` int DEFAULT NULL COMMENT 'สถานะสมัคร',
  `teacher_prefix` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci NOT NULL COMMENT 'คำนำหน้า',
  `teacher_firstname` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci NOT NULL COMMENT 'ชื่อ',
  `teacher_lastname` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci NOT NULL COMMENT 'นามสกุล',
  `display_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL,
  `teacher_image` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'รูปภาพ',
  `tel` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_520_ci DEFAULT NULL COMMENT 'โทร.'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_520_ci;

--
-- dump ตาราง `wp_teacherreg`
--

INSERT INTO `wp_teacherreg` (`ID`, `reg_id`, `school_id`, `go_id`, `groupsara_id`, `activity_id`, `class_id`, `reg_status`, `teacher_prefix`, `teacher_firstname`, `teacher_lastname`, `display_name`, `teacher_image`, `tel`) VALUES
(15, '2023-08-23 10:34:28', '3041200101', '3401200101', 19, 19, 2, NULL, 'นาย', 'ครู', 'นามสกุลครู', NULL, NULL, '0840343344'),
(16, '2023-08-23 10:34:28', '3041200101', '3401200101', 19, 19, 2, NULL, 'นาง', 'อาจารย์', 'นามสกุลอาจารย์', NULL, NULL, '0858554285');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `wp_groupsara`
--
ALTER TABLE `wp_groupsara`
  ADD PRIMARY KEY (`ID`) USING BTREE;

--
-- Indexes for table `wp_schools`
--
ALTER TABLE `wp_schools`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `school_id` (`school_id`);

--
-- Indexes for table `wp_studentreg`
--
ALTER TABLE `wp_studentreg`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `wp_teacherreg`
--
ALTER TABLE `wp_teacherreg`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `school_id` (`school_id`),
  ADD KEY `activity_id` (`activity_id`),
  ADD KEY `class_id` (`class_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `wp_groupsara`
--
ALTER TABLE `wp_groupsara`
  MODIFY `ID` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=519;

--
-- AUTO_INCREMENT for table `wp_schools`
--
ALTER TABLE `wp_schools`
  MODIFY `ID` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `wp_studentreg`
--
ALTER TABLE `wp_studentreg`
  MODIFY `ID` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- AUTO_INCREMENT for table `wp_teacherreg`
--
ALTER TABLE `wp_teacherreg`
  MODIFY `ID` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
